frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_i2c.h
/* I2Cx_SADDR0 */
#define I2C_SADDR0_ADDRESS0             BIT(0)        /*!< bit 0 of a 10-bit address */
#define I2C_SADDR0_ADDRESS              BITS(1,7)     /*!< 7-bit address or bits 7:1 of a 10-bit address */
#define I2C_SADDR0_ADDRESS_H            BITS(8,9)     /*!< highest two bits of a 10-bit address */
#define I2C_SADDR0_ADDFORMAT            BIT(10)       /*!< address mode for the I2C slave */
#define I2C_SADDR0_ADDRESSEN            BIT(15)       /*!< I2C address enable */

/* I2Cx_SADDR1 */
#define I2C_SADDR1_ADDRESS2             BITS(1,7)     /*!< second I2C address for the slave */
#define I2C_SADDR1_ADDMSK2              BITS(8,10)    /*!< ADDRESS2[7:1] mask */
#define I2C_SADDR1_ADDRESS2EN           BIT(15)       /*!< second I2C address enable */

/* I2Cx_TIMING */
#define I2C_TIMING_SCLL                 BITS(0,7)     /*!< SCL low period */
#define I2C_TIMING_SCLH                 BITS(8,15)    /*!< SCL high period */
#define I2C_TIMING_SDADELY              BITS(16,19)   /*!< data hold time */
#define I2C_TIMING_SCLDELY              BITS(20,23)   /*!< data setup time */
#define I2C_TIMING_PSC                  BITS(28,31)   /*!< timing prescaler */

/* I2Cx_TIMEOUT */
#define I2C_TIMEOUT_BUSTOA              BITS(0,11)    /*!< bus timeout A */
#define I2C_TIMEOUT_TOIDLE              BIT(12)       /*!< idle clock timeout detection */
#define I2C_TIMEOUT_TOEN                BIT(15)       /*!< clock timeout detection enable */
#define I2C_TIMEOUT_BUSTOB              BITS(16,27)   /*!< bus timeout B */
#define I2C_TIMEOUT_EXTOEN              BIT(31)       /*!< extended clock timeout detection enable */

/* I2Cx_STAT */
#define I2C_STAT_TBE                    BIT(0)        /*!< I2C_TDATA is empty during transmitting */
#define I2C_STAT_TI                     BIT(1)        /*!< transmit interrupt */
#define I2C_STAT_RBNE                   BIT(2)        /*!< I2C_RDATA is not empty during receiving */
#define I2C_STAT_ADDSEND                BIT(3)        /*!< address received matches in slave mode */
#define I2C_STAT_NACK                   BIT(4)        /*!< not acknowledge flag */
#define I2C_STAT_STPDET                 BIT(5)        /*!< STOP condition detected in slave mode */
#define I2C_STAT_TC                     BIT(6)        /*!< transfer complete in master mode */
#define I2C_STAT_TCR                    BIT(7)        /*!< transfer complete reload */
#define I2C_STAT_BERR                   BIT(8)        /*!< bus error */
#define I2C_STAT_LOSTARB                BIT(9)        /*!< arbitration lost */
#define I2C_STAT_OUERR                  BIT(10)       /*!< overrun/underrun error in slave mode */
#define I2C_STAT_PECERR                 BIT(11)       /*!< PEC error */
#define I2C_STAT_TIMEOUT                BIT(12)       /*!< timeout flag */
#define I2C_STAT_SMBALT                 BIT(13)       /*!< SMBus Alert */
#define I2C_STAT_I2CBSY                 BIT(15)       /*!< busy flag */
#define I2C_STAT_TR                     BIT(16)       /*!< whether the I2C is a transmitter or a receiver in slave mode */
#define I2C_STAT_READDR                 BITS(17,23)   /*!< received match address in slave mode */

/* I2Cx_STATC */
#define I2C_STATC_ADDSENDC              BIT(3)        /*!< ADDSEND flag clear */
#define I2C_STATC_NACKC                 BIT(4)        /*!< not acknowledge flag clear */
#define I2C_STATC_STPDETC               BIT(5)        /*!< STPDET flag clear */
#define I2C_STATC_BERRC                 BIT(8)        /*!< bus error flag clear */
#define I2C_STATC_LOSTARBC              BIT(9)        /*!< arbitration Lost flag clear */
#define I2C_STATC_OUERRC                BIT(10)       /*!< overrun/underrun flag clear */
#define I2C_STATC_PECERRC               BIT(11)       /*!< PEC error flag clear */
#define I2C_STATC_TIMEOUTC              BIT(12)       /*!< TIMEOUT flag clear */
#define I2C_STATC_SMBALTC               BIT(13)       /*!< SMBus Alert flag clear */

/* I2Cx_PEC */
#define I2C_PEC_PECV                    BITS(0,7)     /*!< Packet Error Checking Value that calculated by hardware when PEC is enabled */

/* I2Cx_RDATA */
#define I2C_RDATA_RDATA                 BITS(0,7)     /*!< receive data value */

/* I2Cx_TDATA */
#define I2C_TDATA_TDATA                 BITS(0,7)     /*!< transmit data value */

/* I2Cx_CTL2 */
#define I2C_CTL2_ADDM                   BITS(9,15)    /*!< address bit compare select */

/* constants definitions */
/* define the I2C bit position and its register index offset */
#define I2C_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define I2C_REG_VAL(i2cx, offset)       (REG32((i2cx) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define I2C_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)
#define I2C_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define I2C_REG_VAL2(i2cx, offset)      (REG32((i2cx) + ((uint32_t)(offset) >> 22)))
#define I2C_BIT_POS2(val)               (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define I2C_CTL0_REG_OFFSET            ((uint32_t)0x00000000U)                 /*!< CTL0 register offset */
#define I2C_STAT_REG_OFFSET            ((uint32_t)0x00000018U)                 /*!< STAT register offset */

/* I2C interrupt flags */
typedef enum
{
    I2C_INT_FLAG_TI = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 1U, I2C_STAT_REG_OFFSET, 1U),            /*!< transmit interrupt flag */
    I2C_INT_FLAG_RBNE = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 2U, I2C_STAT_REG_OFFSET, 2U),          /*!< I2C_RDATA is not empty during receiving interrupt flag */
    I2C_INT_FLAG_ADDSEND = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 3U, I2C_STAT_REG_OFFSET, 3U),       /*!< address received matches in slave mode interrupt flag */
    I2C_INT_FLAG_NACK = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 4U, I2C_STAT_REG_OFFSET, 4U),          /*!< not acknowledge interrupt flag */
    I2C_INT_FLAG_STPDET = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 5U, I2C_STAT_REG_OFFSET, 5U),        /*!< stop condition detected in slave mode interrupt flag */
    I2C_INT_FLAG_TC = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 6U, I2C_STAT_REG_OFFSET, 6U),            /*!< transfer complete in master mode interrupt flag */
    I2C_INT_FLAG_TCR = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 6U, I2C_STAT_REG_OFFSET, 7U),           /*!< transfer complete reload interrupt flag */
    I2C_INT_FLAG_BERR = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 7U, I2C_STAT_REG_OFFSET, 8U),          /*!< bus error interrupt flag */
    I2C_INT_FLAG_LOSTARB = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 7U, I2C_STAT_REG_OFFSET, 9U),       /*!< arbitration lost interrupt flag */
    I2C_INT_FLAG_OUERR = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 7U, I2C_STAT_REG_OFFSET, 10U),        /*!< overrun/underrun error in slave mode interrupt flag */
    I2C_INT_FLAG_PECERR = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 7U, I2C_STAT_REG_OFFSET, 11U),       /*!< PEC error interrupt flag */
    I2C_INT_FLAG_TIMEOUT = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 7U, I2C_STAT_REG_OFFSET, 12U),      /*!< timeout interrupt flag */
    I2C_INT_FLAG_SMBALT = I2C_REGIDX_BIT2(I2C_CTL0_REG_OFFSET, 7U, I2C_STAT_REG_OFFSET, 13U),       /*!< SMBus Alert interrupt flag */
}i2c_interrupt_flag_enum;

/* I2C DMA constants definitions */
#define I2C_DMA_TRANSMIT                ((uint32_t)0x00000000U)                 /*!< I2C transmit data use DMA */
#define I2C_DMA_RECEIVE                 ((uint32_t)0x00000001U)                 /*!< I2C receive data use DMA */

/* I2C interrupt enable or disable */
#define I2C_INT_ERR                     I2C_CTL0_ERRIE                          /*!< error interrupt enable */
#define I2C_INT_TC                      I2C_CTL0_TCIE                           /*!< transfer complete interrupt enable */
#define I2C_INT_STPDET                  I2C_CTL0_STPDETIE                       /*!< stop detection interrupt enable */
#define I2C_INT_NACK                    I2C_CTL0_NACKIE                         /*!< not acknowledge received interrupt enable */
#define I2C_INT_ADDM                    I2C_CTL0_ADDMIE                         /*!< address match interrupt enable */
#define I2C_INT_RBNE                    I2C_CTL0_RBNEIE                         /*!< receive interrupt enable */
#define I2C_INT_TI                      I2C_CTL0_TIE                            /*!< transmit interrupt enable */

/* I2C transfer direction in master mode */
#define I2C_MASTER_TRANSMIT             ((uint32_t)0x00000000U)                 /*!< I2C master transmit */
#define I2C_MASTER_RECEIVE              I2C_CTL1_TRDIR                          /*!< I2C master receive */

/* address mode for the I2C slave */
#define I2C_ADDFORMAT_7BITS             ((uint32_t)0x00000000U)                 /*!< address:7 bits */
#define I2C_ADDFORMAT_10BITS            I2C_SADDR0_ADDFORMAT                    /*!< address:10 bits */

/* the length of filter spikes */
#define FILTER_DISABLE                  ((uint32_t)0x00000000U)                 /*!< digital filter is disabled */
#define FILTER_LENGTH_1                 ((uint32_t)0x00000001U)                 /*!< digital filter is enabled and filter spikes with a length of up to 1 tI2CCLK */
#define FILTER_LENGTH_2                 ((uint32_t)0x00000002U)                 /*!< digital filter is enabled and filter spikes with a length of up to 2 tI2CCLK */
#define FILTER_LENGTH_3                 ((uint32_t)0x00000003U)                 /*!< digital filter is enabled and filter spikes with a length of up to 3 tI2CCLK */
#define FILTER_LENGTH_4                 ((uint32_t)0x00000004U)                 /*!< digital filter is enabled and filter spikes with a length of up to 4 tI2CCLK */
#define FILTER_LENGTH_5                 ((uint32_t)0x00000005U)                 /*!< digital filter is enabled and filter spikes with a length of up to 5 tI2CCLK */
#define FILTER_LENGTH_6                 ((uint32_t)0x00000006U)                 /*!< digital filter is enabled and filter spikes with a length of up to 6 tI2CCLK */
#define FILTER_LENGTH_7                 ((uint32_t)0x00000007U)                 /*!< digital filter is enabled and filter spikes with a length of up to 7 tI2CCLK */
#define FILTER_LENGTH_8                 ((uint32_t)0x00000008U)                 /*!< digital filter is enabled and filter spikes with a length of up to 8 tI2CCLK */
#define FILTER_LENGTH_9                 ((uint32_t)0x00000009U)                 /*!< digital filter is enabled and filter spikes with a length of up to 9 tI2CCLK */
#define FILTER_LENGTH_10                ((uint32_t)0x0000000AU)                 /*!< digital filter is enabled and filter spikes with a length of up to 10 tI2CCLK */
#define FILTER_LENGTH_11                ((uint32_t)0x0000000BU)                 /*!< digital filter is enabled and filter spikes with a length of up to 11 tI2CCLK */
#define FILTER_LENGTH_12                ((uint32_t)0x0000000CU)                 /*!< digital filter is enabled and filter spikes with a length of up to 12 tI2CCLK */
#define FILTER_LENGTH_13                ((uint32_t)0x0000000DU)                 /*!< digital filter is enabled and filter spikes with a length of up to 13 tI2CCLK */
#define FILTER_LENGTH_14                ((uint32_t)0x0000000EU)                 /*!< digital filter is enabled and filter spikes with a length of up to 14 tI2CCLK */
#define FILTER_LENGTH_15                ((uint32_t)0x0000000FU)                 /*!< digital filter is enabled and filter spikes with a length of up to 15 tI2CCLK */

/* defines which bits of register ADDRESS[7:1] are compared with an incoming address byte */
#define ADDRESS_BIT1_COMPARE            ((uint32_t)0x00000200U)                 /*!< address bit1 needs compare */
#define ADDRESS_BIT2_COMPARE            ((uint32_t)0x00000400U)                 /*!< address bit2 needs compare */
#define ADDRESS_BIT3_COMPARE            ((uint32_t)0x00000800U)                 /*!< address bit3 needs compare */
#define ADDRESS_BIT4_COMPARE            ((uint32_t)0x00001000U)                 /*!< address bit4 needs compare */
#define ADDRESS_BIT5_COMPARE            ((uint32_t)0x00002000U)                 /*!< address bit5 needs compare */
#define ADDRESS_BIT6_COMPARE            ((uint32_t)0x00004000U)                 /*!< address bit6 needs compare */
#define ADDRESS_BIT7_COMPARE            ((uint32_t)0x00008000U)                 /*!< address bit7 needs compare */

